nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z83/drivers/fsl_romapi.c
    return status;
}

/*!
 * @brief Programs flash pages with data at locations passed in through parameters.
 */
status_t FLASH_ProgramPage(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t *src, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);
    assert(src);

    status_t status = kStatus_Fail;

    status = flash_check_param(config, base, start, lengthInBytes, FSL_FEATURE_FLASH_PFLASH_PAGE_SIZE);
    if (status == kStatus_FLASH_Success)
    {
        /* Align length to whole phrase. */
        uint32_t alignedLength = ALIGN_DOWN(lengthInBytes, sizeof(uint8_t) * FSL_FEATURE_FLASH_PFLASH_PAGE_SIZE);
        uint32_t extraBytes    = lengthInBytes - alignedLength;
        uint32_t *srcWord      = (uint32_t *)(uintptr_t)src;

        if (alignedLength > 0U)
        {
            uint32_t endAddress = start + alignedLength - 1U;
            while (start <= endAddress)
            {
                status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_program_page(
                    config, base, start, srcWord, FSL_FEATURE_FLASH_PFLASH_PAGE_SIZE);
                if (kStatus_FLASH_Success != status)
                {
                    break;
                }
                else
                {
                    /* Increment to the next page */
                    start += FSL_FEATURE_FLASH_PFLASH_PAGE_SIZE;
                    srcWord += 32U;
                }
            }
        }
        else
        {
            ; /* Do nothing */
        }

        if ((kStatus_FLASH_Success == status) && (extraBytes > 0U))
        {
            uint32_t extraData[32] = {
                0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu,
                0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu,
                0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu,
                0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu, 0xFFFFFFFFu};

            /* Copy extra bytes to page buffer. */
            union
            {
                uint32_t *src;
                const void *srcVoid;
            } srcPtr;
            srcPtr.src = srcWord;

            union
            {
                uint32_t *xData;
                void *xDataVoid;
            } xDataPtr;
            xDataPtr.xData = (uint32_t *)&extraData[0];

            (void)memcpy(xDataPtr.xDataVoid, srcPtr.srcVoid, extraBytes);

            status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_program_page(config, base, start, extraData,
                                                                                  FSL_FEATURE_FLASH_PFLASH_PAGE_SIZE);
        }
    }
    else
    {
        ; /* Do nothing */
    }

    return status;
}

/*!
 * @brief Verify that the flash phrases are erased
 */
status_t FLASH_VerifyErasePhrase(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_verify_erase_phrase(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that all flash and IFR space is erased
 */
status_t FLASH_VerifyEraseAll(FMU_Type *base)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_verify_erase_all(base);

    return status;
}

/*!
 * @brief Verify that the flash pages are erased
 */
status_t FLASH_VerifyErasePage(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_verify_erase_page(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that the flash sector are erased
 */
status_t FLASH_VerifyEraseSector(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_verify_erase_sector(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Read into MISR
 *
 * The Read into MISR operation generates a signature based on the contents of the selected
 * flash memory using an embedded MISR.
 */
status_t FLASH_ReadIntoMisr(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t endAddr, uint32_t *seed, uint32_t *signature)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);
    assert(seed);
    assert(signature);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_read_into_misr(config, base, start, endAddr, seed, signature);

    return status;
}

/*!
 * @brief Returns the desired flash property.
 */
status_t FLASH_GetProperty(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(value);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_get_property(config, whichProperty, value);

    return status;
}
#if defined(__IAR_SYSTEMS_ICC__)
__ramfunc
#elif defined(__GNUC__)
__attribute__ ((section (".ramfunc")))
#endif
    void
    FLASH_CACHE_Disable(void)
{
    SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF2_MASK)) | SMSCM_OCMDR0_OCMCF2(0x1);
    SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF2_MASK)) | SMSCM_OCMDR0_OCMCF2(0xC);
    SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF1_MASK)) | SMSCM_OCMDR0_OCMCF1(0x3);
    __ISB();
    __DSB();
}

#if defined(__IAR_SYSTEMS_ICC__)
__ramfunc
#elif defined(__GNUC__)
__attribute__ ((section (".ramfunc")))
#endif
    void
    FLASH_CACHE_Clear(bool isPreProcess)
{
    if (isPreProcess == false)
    {
        SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF2_MASK)) | SMSCM_OCMDR0_OCMCF2(0x1);
        SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF1_MASK)) | SMSCM_OCMDR0_OCMCF1(0x0);
    }
    else
    {
        SMSCM->OCMDR0 = (SMSCM->OCMDR0 & (~SMSCM_OCMDR0_OCMCF1_MASK)) | SMSCM_OCMDR0_OCMCF1(0x3);
    }

    /* Memory barriers for good measure.
     * All Cache, Branch predictor and TLB maintenance operations before this instruction complete */
    __ISB();
    __DSB();
}

static status_t flash_check_param(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes, uint32_t alignmentBaseline)
{
    assert(config);
    assert(base);

    status_t status = kStatus_FLASH_InvalidArgument;

