nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z83/drivers/fsl_romapi.c
    if (lengthInBytes == 0U)
    {
        status = kStatus_FLASH_Success;
    }
#if defined(RF_FMU)
    else if ((config == NULL) || (base == NULL) || ((base != FMU0) && (base != RF_FMU)))
    {
        status = kStatus_FLASH_InvalidArgument;
    }
#else
    else if ((config == NULL) || (base == NULL) || (base != FMU0))
    {
        status = kStatus_FLASH_InvalidArgument;
    }
#endif
    /* Verify the start is alignmentBaseline aligned. */
    else if ((start & (alignmentBaseline - 1U)) != 0u)
    {
        status = kStatus_FLASH_AlignmentError;
    }
    else
    {
        start = start & 0xEFFFFFFFU;

        if (base == FMU0)
        {
            /* Validates the range of the given address */
            if ((start >= config->msf1Config[0].flashDesc.blockBase) &&
                ((start + lengthInBytes) <=
                 (config->msf1Config[0].flashDesc.blockBase + config->msf1Config[0].flashDesc.totalSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else if ((start >= config->msf1Config[0].ifrDesc.pflashIfr0Start) &&
                     ((start + lengthInBytes) <= (config->msf1Config[0].ifrDesc.pflashIfr0Start +
                                                  config->msf1Config[0].ifrDesc.pflashIfr0MemSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else
            {
                status = kStatus_FLASH_AddressError;
            }
        }
        else /* if (base == RF_FMU) */
        {
            /* Validates the range of the given address */
            if ((start >= config->msf1Config[1].flashDesc.blockBase) &&
                ((start + lengthInBytes) <=
                 (config->msf1Config[1].flashDesc.blockBase + config->msf1Config[1].flashDesc.totalSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else if ((start >= config->msf1Config[1].ifrDesc.pflashIfr0Start) &&
                     ((start + lengthInBytes) <= (config->msf1Config[1].ifrDesc.pflashIfr0Start +
                                                  config->msf1Config[1].ifrDesc.pflashIfr0MemSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else
            {
                status = kStatus_FLASH_AddressError;
            }
        }
    }

    return status;
}

/******************************************************
 * IFR driver
 ******************************************************/
/*!
 * @brief Verify that the ifr phrases are erased
 */
status_t FLASH_VerifyEraseIFRPhrase(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_phrase(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that the ifr pages are erased
 */
status_t FLASH_VerifyEraseIFRPage(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_page(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that the ifr sectors are erased
 */
status_t FLASH_VerifyEraseIFRSector(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_sector(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Read IFR into MISR
 *
 * The Read IFR into MISR operation generates a signature based on the contents of the
 * selected IFR space using an embedded MISR.
 */
status_t FLASH_ReadIFRIntoMisr(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t endAddr, uint32_t *seed, uint32_t *signature)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(config);
    assert(base);
    assert(seed);
    assert(signature);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_read_into_misr(config, base, start, endAddr, seed, signature);

    return status;
}

/********************************************************************************
 *  Lpspi EEPROM API
 *******************************************************************************/
/*!
 * @brief Initialize SPI NOR/EEPROM
 *
 * @param baudRate Config baudrate for SPI.
 */
status_t SPI_EepromInit(uint32_t baudRate)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_init(baudRate);
}

/*!
 * @brief Read data via SPI NOR/EEPROM
 */
status_t SPI_EepromRead(uint8_t *dest, uint32_t length, uint32_t address, bool requestFastRead)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(dest);

    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_read(dest, length, address, requestFastRead);
}

/*!
 * @brief Write data via SPI NOR/EEPROM
 */
status_t SPI_EepromWrite(uint8_t *data, uint32_t length, uint32_t address)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(data);

    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_write(data, length, address);
}

/*!
 * @brief Erase data via SPI NOR/EEPROM
 */
status_t SPI_EepromErase(uint32_t address, eraseOptions_t option)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_erase(address, option);
}

/*! @brief De-initialize LPSPI
 */
void SPI_EepromFinalize(void)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_finalize();
}

/********************************************************************************
 * Bootloader API
 *******************************************************************************/
/*!
 * @brief This API is used to initialize bootloader and nboot context necessary to process sb3 file format.
 */
status_t KB_Init(void)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_init();
}

/*!
 * @brief This API is used to decrypt sb3 file and store signed image contents specified by loader command supported
 * while generating sb3 image through Json configuration. If sb3 file to be processed includes sblaoder command
 * "programFuses" then voltage must be regulated for over-drive and normalize voltage once operation is completed.
 *
 * @param data A Pointer to start of sb file data in memory.
 * @param dataLength sb file data length in bytes.
 * @param isUpdateExt Indicator for update(sb) file start address is in internal or external flash.
 *
 * @retval #kStatus_Success API was executed successfully.
 * @retval #kStatus_Fail API execution failed.
 * @retval #kStatus_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_LPSPI_Busy LPSPI transfer is busy.
 * @retval #kStatusRomLdrDataUnderrun
 */
status_t KB_Execute(const uint8_t *data, uint32_t dataLength, uint32_t isUpdateExt)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(data);

    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_execute(data, dataLength, isUpdateExt);
}

/*!
 * @brief This API is used to release nboot context and finalize sb3 file processing.
 */
status_t KB_Deinit(void)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_deinit();
}

/********************************************************************************
 * Interface for image authentication API
 *******************************************************************************/
/*!
 * @brief The function is used for initializing of the nboot context data structure.
 * It should be called prior to any other calls of nboot API.
 */
nboot_status_t NBOOT_ContextInit(nboot_context_t *context)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_context_init(context);
}

/*!
 * @brief The function is used to deinitialize nboot context data structure.
 * Its contents are overwritten with random data so that any sensitive data does not remain in memory.
 */
nboot_status_t NBOOT_ContextFree(nboot_context_t *context)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);

